In [3]:
import pandas as pd

In [4]:
Source_file = "../Resources/purchase_data.csv"

In [5]:
Purchase_data = pd.read_csv(Source_file)
Purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
Peopledata=Purchase_data[["SN","Gender","Age"]]
Peopledata=Peopledata.drop_duplicates()
Peopledata.head()

              SN Gender  Age
0        Lisim78   Male   20
1    Lisovynya38   Male   40
2     Ithergue48   Male   24
3  Chamassasya86   Male   24
4      Iskosia90   Male   23

In [7]:
Playercount=len(Peopledata)
Playercount

576

In [8]:
Playercount_df=pd.DataFrame({"Total Players":[Playercount]})
Playercount_df

   Total Players
0            576

In [9]:
Uniqueitem=len(Purchase_data["Item ID"].unique())
Uniqueitem

179

In [10]:
Averageprice=round(Purchase_data["Price"].mean(),2)
Averageprice

3.05

In [11]:
NumberofPurchases=len(Purchase_data)
NumberofPurchases

780

In [12]:
Totalrevenues=Purchase_data["Price"].sum()
Totalrevenues

2379.77

In [13]:
Purchasing_analysis_df=pd.DataFrame({"Number of Unique item":[Uniqueitem],
                                    "Average Price":[Averageprice],
                                    "Number of Purchases":[NumberofPurchases],
                                    "Total revenues":[Totalrevenues]})
Purchasing_analysis_df

   Number of Unique item  Average Price  Number of Purchases  Total revenues
0                    179           3.05                  780         2379.77

In [14]:
Gendercount=Peopledata["Gender"].value_counts()
Gendercount

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [15]:
Gendercountpercentage=round(Gendercount/Playercount*100,2)
Gendercountpercentage

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [16]:
Gender_demographics_df=pd.DataFrame({"Total count":Gendercount,"Percentage of players":Gendercountpercentage})
Gender_demographics_df

                       Total count  Percentage of players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [17]:
Purchase_count_by_gender=Purchase_data.groupby(["Gender"]).count()["Price"]
Purchase_count_by_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [18]:
Purchase_mean_by_gender=round(Purchase_data.groupby(["Gender"]).mean()["Price"],2)
Purchase_mean_by_gender

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [19]:
Total_Purchase_value_by_gender=round(Purchase_data.groupby(["Gender"]).sum()["Price"],2)
Total_Purchase_value_by_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [20]:
Average_total_purchase=round(Total_Purchase_value_by_gender/Gender_demographics_df["Total count"],2)
Average_total_purchase

Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [21]:
Purchasing_analysis_gender_df=pd.DataFrame({"Purchase count":Purchase_count_by_gender,
                                           "Average Purchase Price":Purchase_mean_by_gender,
                                           "Total Purchase value":Total_Purchase_value_by_gender,
                                           "Average total Purchase per person":Average_total_purchase})
Purchasing_analysis_gender_df

,Purchase count,Average Purchase Price,Total Purchase value,Average total Purchase per person
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [22]:
bins=[0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,99.99]
Labels=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
Peopledata["Age Ranges"]=pd.cut(Peopledata["Age"],bins,labels=Labels)
Peopledata

                SN  Gender  Age Age Ranges
0          Lisim78    Male   20      20-24
1      Lisovynya38    Male   40        40+
2       Ithergue48    Male   24      20-24
3    Chamassasya86    Male   24      20-24
4        Iskosia90    Male   23      20-24
..             ...     ...  ...        ...
773         Hala31    Male   21      20-24
774     Jiskjask80    Male   11      10-14
775     Aethedru70  Female   21      20-24
777     Yathecal72    Male   20      20-24
778        Sisur91    Male    7        <10

[576 rows x 4 columns]

In [23]:
countofranges=Peopledata["Age Ranges"].value_counts()
countofranges

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [24]:
Percentageofranges=round(countofranges/Playercount*100,2)
Percentageofranges

20-24    44.79
15-19    18.58
25-29    13.37
30-34     9.03
35-39     5.38
10-14     3.82
<10       2.95
40+       2.08
Name: Age Ranges, dtype: float64

In [25]:
Age_demographics_df=pd.DataFrame({"Total count":countofranges,
                                 "Percentage of players":Percentageofranges})

Age_demographics_df=  Age_demographics_df.sort_index()
Age_demographics_df

       Total count  Percentage of players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

In [26]:
Total_basedonusername=round(Purchase_data.groupby(["SN"]).sum()["Price"],2)
Total_basedonusername

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [27]:
Average_basedonusername=round(Purchase_data.groupby(["SN"]).mean()["Price"],2)
Average_basedonusername

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       2.07
Yathedeu43       3.01
Yoishirrala98    4.58
Zhisrisu83       3.94
Zontibe81        2.68
Name: Price, Length: 576, dtype: float64

In [28]:
Count_basedonusername=(Purchase_data.groupby(["SN"]).count()["Price"])
Count_basedonusername

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [29]:
Top_Spenders_df=pd.DataFrame({"Purchase count":Count_basedonusername,
                             "Average Purchase Price":Average_basedonusername,
                          "Total Purchase Value":Total_basedonusername})
Top_Spenders_df=Top_Spenders_df.sort_values("Total Purchase Value", ascending=False) 
Top_Spenders_df.head(5)

             Purchase count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                    3.79                 18.96
Idastidru52               4                    3.86                 15.45
Chamjask73                3                    4.61                 13.83
Iral74                    4                    3.40                 13.62
Iskadarya95               3                    4.37                 13.10

In [30]:
Count_basedonitemID=(Purchase_data.groupby(["Item ID","Item Name"]).count()["Price"])
Count_basedonitemID

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [31]:
Total_basedonitemID=(Purchase_data.groupby(["Item ID","Item Name"]).sum()["Price"])
Total_basedonitemID

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [32]:
Average_basedonitemID=(Purchase_data.groupby(["Item ID","Item Name"]).mean()["Price"])
Average_basedonitemID

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [33]:
Priceofitem=Purchase_data["Price"]
Priceofitem.head()

0    3.53
1    1.56
2    4.88
3    3.27
4    1.44
Name: Price, dtype: float64

In [34]:
Most_Popular_items_df=pd.DataFrame({"Purchase count":Count_basedonitemID,
                                   "Item Price":Average_basedonitemID,
                                   "Total Purchase Value":Total_basedonitemID})
Most_Popular_items_df=Most_Popular_items_df.sort_values("Purchase count", ascending=False) 
Most_Popular_items_df.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

In [35]:
Most_Popular_items_df=pd.DataFrame({"Purchase count":Count_basedonitemID,
                                   "Item Price":Average_basedonitemID,
                                   "Total Purchase Value":Total_basedonitemID})
Most_Popular_items_df=Most_Popular_items_df.sort_values("Total Purchase Value", ascending=False) 
Most_Popular_items_df.head()

,,Purchase count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80